New York Taxi data
Go to the website http://www.nyc.gov/html/tlc/html/about/trip_record_data.shtml
Choose green taxi data in February 2018 and download
Or you can use a ‘git pull’ if you have already set up the git repository of python open lab
The csv file in the folder of files

Pandas
Pandas is a package built on top of Numpy
Dataframe is the core data structure of Pandas
Multidimensional arrays with rows and columns
Heterogeneous types and/or missing data 
We can see dataframe as a matrix

Loading files
In pandas, different types of data can be loaded easily
Code:
import pandas as pd
pd.read_csv(filename)
pd.read_excel(filename)
pd.read_html(filename)
pd.read_sql(filename)

In [1]:
#Loading our taxi data
import pandas as pd
import numpy as np
taxi_data = pd.read_csv('./files/green_tripdata_2018-02.csv')
print(type(taxi_data))

<class 'pandas.core.frame.DataFrame'>

The variable taxi_data holds all data from the csv file
The file path need to be correct according to your file system
Absolute path or relative path are both fine
Function ‘read_csv’ returns a dataframe

In [2]:
# to see the head of this dataframe
#show first 5 lines by default

taxi_data.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type
0,2,2018-02-01 00:39:38,2018-02-01 00:39:41,N,5,97,65,1,0.00,20.0,0.0,0.0,3.00,0.0,NaN,0.0,23.00,1,2
1,2,2018-02-01 00:58:28,2018-02-01 01:05:35,N,1,256,80,5,1.60,7.5,0.5,0.5,0.88,0.0,NaN,0.3,9.68,1,1
2,2,2018-02-01 00:56:05,2018-02-01 01:18:54,N,1,25,95,1,9.60,28.5,0.5,0.5,5.96,0.0,NaN,0.3,35.76,1,1
3,2,2018-02-01 00:12:40,2018-02-01 00:15:50,N,1,61,61,1,0.73,4.5,0.5,0.5,0.00,0.0,NaN,0.3,5.80,2,1
4,2,2018-02-01 00:45:18,2018-02-01 00:51:56,N,1,65,17,2,1.87,8.0,0.5,0.5,0.00,0.0,NaN,0.3,9.30,2,1

In [3]:
#we can add parameter to function head()

taxi_data.head(10)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type
0,2,2018-02-01 00:39:38,2018-02-01 00:39:41,N,5,97,65,1,0.00,20.0,0.0,0.0,3.00,0.0,NaN,0.0,23.00,1,2
1,2,2018-02-01 00:58:28,2018-02-01 01:05:35,N,1,256,80,5,1.60,7.5,0.5,0.5,0.88,0.0,NaN,0.3,9.68,1,1
2,2,2018-02-01 00:56:05,2018-02-01 01:18:54,N,1,25,95,1,9.60,28.5,0.5,0.5,5.96,0.0,NaN,0.3,35.76,1,1
3,2,2018-02-01 00:12:40,2018-02-01 00:15:50,N,1,61,61,1,0.73,4.5,0.5,0.5,0.00,0.0,NaN,0.3,5.80,2,1
4,2,2018-02-01 00:45:18,2018-02-01 00:51:56,N,1,65,17,2,1.87,8.0,0.5,0.5,0.00,0.0,NaN,0.3,9.30,2,1
5,2,2018-02-01 00:30:57,2018-02-01 00:52:23,N,1,65,68,2,5.69,20.0,0.5,0.5,0.00,0.0,NaN,0.3,21.30,2,1
6,1,2018-02-01 00:38:24,2018-02-01 00:50:24,N,1,17,35,1,2.90,11.5,0.5,0.5,0.00,0.0,NaN,0.3,12.80,2,1
7,2,2018-02-01 00:09:15,2018-02-01 00:29:13,N,1,181,226,1,6.77,22.0,0.5,0.5,0.00,0.0,NaN,0.3,23.30,2,1
8,1,2018-02-01 00:08:51,2018-02-01 00:15:14,N,5,168,168,1,0.80,0.0,0.0,0.0,0.00,0.0,NaN,0.0,0.00,2,2
9,2,2018-02-01 00:10:14,2018-02-02 00:00:00,N,1,97,7,1,10.03,28.0,0.5,0.5,7.32,0.0,NaN,0.3,36.62,1,1

In [4]:
taxi_data.describe()

,VendorID,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type
count,769940.000000,769940.000000,769940.000000,769940.000000,769940.000000,769940.000000,769940.000000,769940.000000,769940.000000,769940.000000,769940.000000,0.0,769940.000000,769940.000000,769940.000000,769940.000000
mean,1.829091,1.066778,109.968160,128.311900,1.356391,2.725387,11.882591,0.336679,0.488929,1.040139,0.090295,NaN,0.293621,14.156694,1.462002,1.016383
std,0.376430,0.504027,74.226968,76.862844,1.033778,2.882936,9.745038,0.395280,0.081043,1.821846,0.777109,NaN,0.047854,10.707214,0.519115,0.126944
min,1.000000,1.000000,1.000000,1.000000,0.000000,0.000000,-400.000000,-4.500000,-0.500000,-14.190000,0.000000,NaN,-0.300000,-400.000000,1.000000,1.000000
25%,2.000000,1.000000,49.000000,61.000000,1.000000,1.000000,6.000000,0.000000,0.500000,0.000000,0.000000,NaN,0.300000,7.800000,1.000000,1.000000
50%,2.000000,1.000000,82.000000,129.000000,1.000000,1.750000,9.000000,0.000000,0.500000,0.000000,0.000000,NaN,0.300000,11.150000,1.000000,1.000000
75%,2.000000,1.000000,166.000000,189.000000,1.000000,3.370000,14.500000,0.500000,0.500000,1.760000,0.000000,NaN,0.300000,17.000000,2.000000,1.000000
max,2.000000,6.000000,265.000000,265.000000,9.000000,120.470000,2624.500000,4.500000,0.550000,104.000000,99.990000,NaN,0.300000,2626.300000,5.000000,2.000000

In [5]:
#buiding series by list

series_data = pd.Series([0.25, 0.5, 0.75, 1.0])
print(series_data)

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [6]:
#just want to output the values

print(series_data.values)

[0.25 0.5  0.75 1.  ]

In [7]:
#data can be accessed by index, really similar to array

print(series_data[0])
print(series_data[1:3])

0.25
1    0.50
2    0.75
dtype: float64

In [8]:
#building series by values and indexes
#the function is pd.Series(data, index=index)

series_data = pd.Series([0.25, 0.5, 0.75, 1.0],index=['a', 'b', 'c', 'd'])
series_data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [9]:
#accessing data by index

series_data['b']

0.5

In [10]:
#changing date by index
series_data['b'] = 2.0
print(series_data)

a    0.25
b    2.00
c    0.75
d    1.00
dtype: float64

In [11]:
#accessing data by indexes

series_data['b':'d']

b    2.00
c    0.75
d    1.00
dtype: float64

In [12]:
#building series by values and indexes

series_data = pd.Series([0.25, 0.5, 0.75, 1.0],index=[2, 5, 3, 7])
series_data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [13]:
#accessing data by index

series_data[3]

0.75

In [14]:
#accessing data by positions

series_data[0:2]

2    0.25
5    0.50
dtype: float64

In [15]:
series_data.reset_index()
series_data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [16]:
#the structure of series is similar to a dictionary
population_dict = {'California': 38332521,'Texas': 26448193, 'New York': 19651127, 'Florida': 19552860}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

In [17]:
#accessing value by index
population['Texas']

26448193

In [18]:
#building dataframe
population_frame = pd.DataFrame(population, columns=['population'])
population_frame

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860

In [19]:
population_frame.head(3)

            population
California    38332521
Texas         26448193
New York      19651127

In [20]:
#building dataframe from dictionary, automatically fill missing data
df = pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])
print(df)

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [21]:
#building dataframe by declareing column names and row names
df = pd.DataFrame(np.random.rand(3, 2), columns=['foo', 'bar'], index=['a', 'b', 'c'])
df

        foo       bar
a  0.179815  0.651763
b  0.477280  0.718776
c  0.929284  0.023947

In [22]:
#get the column 'foo'
df['foo']

a    0.179815
b    0.477280
c    0.929284
Name: foo, dtype: float64

In [23]:
#get the column 'foo'
df.foo

a    0.179815
b    0.477280
c    0.929284
Name: foo, dtype: float64

In [24]:
df['density'] = df['foo']/df['bar']
df

        foo       bar    density
a  0.179815  0.651763   0.275890
b  0.477280  0.718776   0.664017
c  0.929284  0.023947  38.806169

In [25]:
#iloc, access element by position 
df.iloc[1,1]

0.7187762038443003

In [26]:
#mutiple rows and columns
df.iloc[:2,:2]

        foo       bar
a  0.179815  0.651763
b  0.477280  0.718776

In [27]:
#mutiple rows and columns
df.iloc[1:,1:]

        bar    density
b  0.718776   0.664017
c  0.023947  38.806169

In [28]:
#loc, access element by row and column name
df.loc['a','foo']

0.17981457962113023

In [29]:
#mutiple columns
df.loc['a',:'density']

foo        0.179815
bar        0.651763
density    0.275890
Name: a, dtype: float64

In [30]:
#mutiple rows
df.loc[df.foo > 0.5, 'density']

c    38.806169
Name: density, dtype: float64

In [31]:
#changing values by iloc
df.iloc[1,1] = 500
df

        foo         bar    density
a  0.179815    0.651763   0.275890
b  0.477280  500.000000   0.664017
c  0.929284    0.023947  38.806169

In [32]:
#changing values by loc
df.loc['b','bar'] = 5
df

        foo       bar    density
a  0.179815  0.651763   0.275890
b  0.477280  5.000000   0.664017
c  0.929284  0.023947  38.806169

In [33]:
#get lines where bar < 5
df[df.bar < 5]

        foo       bar    density
a  0.179815  0.651763   0.275890
c  0.929284  0.023947  38.806169

In [34]:
#handle taxi data
taxi_data = pd.read_csv('./files/green_tripdata_2018-02.csv')

In [35]:
taxi_data.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type
0,2,2018-02-01 00:39:38,2018-02-01 00:39:41,N,5,97,65,1,0.00,20.0,0.0,0.0,3.00,0.0,NaN,0.0,23.00,1,2
1,2,2018-02-01 00:58:28,2018-02-01 01:05:35,N,1,256,80,5,1.60,7.5,0.5,0.5,0.88,0.0,NaN,0.3,9.68,1,1
2,2,2018-02-01 00:56:05,2018-02-01 01:18:54,N,1,25,95,1,9.60,28.5,0.5,0.5,5.96,0.0,NaN,0.3,35.76,1,1
3,2,2018-02-01 00:12:40,2018-02-01 00:15:50,N,1,61,61,1,0.73,4.5,0.5,0.5,0.00,0.0,NaN,0.3,5.80,2,1
4,2,2018-02-01 00:45:18,2018-02-01 00:51:56,N,1,65,17,2,1.87,8.0,0.5,0.5,0.00,0.0,NaN,0.3,9.30,2,1

In [36]:
#get the total count of missing value in tip_amount
sum(taxi_data.tip_amount.isnull())

0

In [37]:
#set a value to missing
taxi_data.iloc[0,-3] = np.nan

In [38]:
taxi_data.total_amount.head()

0      NaN
1     9.68
2    35.76
3     5.80
4     9.30
Name: total_amount, dtype: float64

In [39]:
#get the total count of missing value in tip_amount
assert 0 == sum(taxi_data.total_amount.isnull())

AssertionError:

In [40]:
#get the total count of missing value in tip_amount
assert 1 == sum(taxi_data.total_amount.isnull())

In [41]:
#dealing with the missing value
#fillna
taxi_data['total_amount'].fillna(inplace= True,method='bfill')
taxi_data.total_amount.head()

0     9.68
1     9.68
2    35.76
3     5.80
4     9.30
Name: total_amount, dtype: float64

In [42]:
#set a value to missing
taxi_data.iloc[0,-3] = np.nan

taxi_data['total_amount'].fillna(taxi_data['total_amount'].mean() , inplace = True)
taxi_data.total_amount.head()

0    14.156682
1     9.680000
2    35.760000
3     5.800000
4     9.300000
Name: total_amount, dtype: float64

In [43]:
#set a value to missing
taxi_data.iloc[1,-3] = np.nan

taxi_data['total_amount'].fillna( inplace = True,method='ffill')
taxi_data.total_amount.head()

0    14.156682
1    14.156682
2    35.760000
3     5.800000
4     9.300000
Name: total_amount, dtype: float64

In [44]:
#find the mean of tip_amount
taxi_data.tip_amount.mean()

1.0401385692391616

In [45]:
#find the max of tip_amount
taxi_data.tip_amount.max()

104.0

In [46]:
#find the min of tip_amount
taxi_data.tip_amount.min()

-14.19

In [47]:
#find the median of tip_amount
taxi_data.tip_amount.median()

0.0

In [48]:
#method describe()
taxi_data.tip_amount.describe()

count    769940.000000
mean          1.040139
std           1.821846
min         -14.190000
25%           0.000000
50%           0.000000
75%           1.760000
max         104.000000
Name: tip_amount, dtype: float64

In [49]:
taxi_data.total_amount > 500

0         False
1         False
2         False
3         False
4         False
5         False
6         False
7         False
8         False
9         False
10        False
11        False
12        False
13        False
14        False
15        False
16        False
17        False
18        False
19        False
20        False
21        False
22        False
23        False
24        False
25        False
26        False
27        False
28        False
29        False
          ...
769910    False
769911    False
769912    False
769913    False
769914    False
769915    False
769916    False
769917    False
769918    False
769919    False
769920    False
769921    False
769922    False
769923    False
769924    False
769925    False
769926    False
769927    False
769928    False
769929    False
769930    False
769931    False
769932    False
769933    False
769934    False
769935    False
769936    False
769937    False
769938    False
769939    False
Name: total_amount, Length: 769940, dtype: bool

In [50]:
#find rows with total_amount > 500
taxi_data[taxi_data.total_amount > 500]

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type
215106,2,2018-02-12 10:09:09,2018-02-12 10:09:09,N,1,193,193,5,0.00,2624.5,1.0,0.5,0.0,0.0,NaN,0.3,2626.3,2,1
461605,2,2018-02-18 09:01:32,2018-02-18 09:01:32,N,1,247,260,4,13.46,628.0,0.0,0.5,0.0,0.0,NaN,0.3,628.8,2,1
593052,2,2018-02-23 10:13:51,2018-02-23 10:13:51,N,1,193,193,5,0.00,522.5,1.0,0.5,0.0,0.0,NaN,0.3,524.3,2,1

In [51]:
#find rows with total_amount > 500 and passenger_count > 4
taxi_data[taxi_data.total_amount > 500][taxi_data.passenger_count >4]

C:\Users\18362\Anaconda2\envs\coms007\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type
215106,2,2018-02-12 10:09:09,2018-02-12 10:09:09,N,1,193,193,5,0.0,2624.5,1.0,0.5,0.0,0.0,NaN,0.3,2626.3,2,1
593052,2,2018-02-23 10:13:51,2018-02-23 10:13:51,N,1,193,193,5,0.0,522.5,1.0,0.5,0.0,0.0,NaN,0.3,524.3,2,1

In [52]:
#get one column tip_amount
taxi_data['tip_amount']

0         3.00
1         0.88
2         5.96
3         0.00
4         0.00
5         0.00
6         0.00
7         0.00
8         0.00
9         7.32
10        4.06
11        0.00
12        0.00
13        8.55
14        0.00
15        0.00
16        0.00
17        2.04
18        1.26
19        4.76
20        0.00
21        0.00
22        0.00
23        0.00
24        0.00
25        0.00
26        2.08
27        1.80
28        0.00
29        1.75
          ...
769910    0.00
769911    0.00
769912    1.36
769913    1.06
769914    1.45
769915    3.26
769916    0.00
769917    0.00
769918    0.00
769919    0.00
769920    0.00
769921    1.16
769922    1.16
769923    0.01
769924    0.00
769925    5.82
769926    0.00
769927    0.00
769928    1.66
769929    1.46
769930    0.00
769931    0.00
769932    0.00
769933    0.00
769934    1.00
769935    0.00
769936    2.00
769937    1.00
769938    2.00
769939    3.39
Name: tip_amount, Length: 769940, dtype: float64

In [53]:
#get multiple columns, tip_amount and total_amount
taxi_data[['tip_amount','total_amount']]

        tip_amount  total_amount
0             3.00     14.156682
1             0.88     14.156682
2             5.96     35.760000
3             0.00      5.800000
4             0.00      9.300000
5             0.00     21.300000
6             0.00     12.800000
7             0.00     23.300000
8             0.00      0.000000
9             7.32     36.620000
10            4.06     24.360000
11            0.00     26.300000
12            0.00      7.800000
13            8.55     51.350000
14            0.00      6.800000
15            0.00      6.300000
16            0.00      5.300000
17            2.04      8.840000
18            1.26      7.560000
19            4.76     28.560000
20            0.00      5.800000
21            0.00      9.800000
22            0.00     10.300000
23            0.00     18.800000
24            0.00      8.300000
25            0.00     35.000000
26            2.08     10.380000
27            1.80      9.100000
28            0.00     11.300000
29            1.75     10.550000
...            ...           ...
769910        0.00     10.800000
769911        0.00      8.800000
769912        1.36      8.160000
769913        1.06      6.360000
769914        1.45      7.250000
769915        3.26     19.560000
769916        0.00      7.300000
769917        0.00      6.800000
769918        0.00     11.300000
769919        0.00      5.800000
769920        0.00      4.800000
769921        1.16      6.960000
769922        1.16      6.960000
769923        0.01     10.810000
769924        0.00     15.300000
769925        5.82     29.120000
769926        0.00      7.300000
769927        0.00     10.800000
769928        1.66      9.960000
769929        1.46      8.760000
769930        0.00      6.300000
769931        0.00      6.300000
769932        0.00     22.800000
769933        0.00     12.800000
769934        1.00      9.800000
769935        0.00      6.300000
769936        2.00     17.300000
769937        1.00     20.300000
769938        2.00      7.800000
769939        3.39     14.690000

[769940 rows x 2 columns]

In [54]:
#using loc to get specific rows and columns
taxi_data.loc[[1,2],['tip_amount','total_amount']]

   tip_amount  total_amount
1        0.88     14.156682
2        5.96     35.760000

Reference:
    Python data science handbook, Jake VanderPlas,first edition, pp.97-124